[
    {
        "role":"Developer",
        "company":"[Cointel Finance](https://www.cointel.finance/)",
        "summary":"Programmed an arbitrage bot in Web3.py that runs 24/7 looking for profitable trades across AVAX assets. Created data pipelines for storage of arbitrage opportunities for future analytics.  Pipeline was done with an on-prem server config primarily using Docker images of custom websockets to Web3 Contract ABIs.  Trade execution contract was compiled & deployed via Remix.",
        "range":"November 2021 - Present",
        "tech": "Web3, Python, R Shiny, Solidity, SQLite, Docker"
    },
    {
        "role":"Full Stack Developer",
        "company":"[Pennsylvania State University](https://www.psu.edu/)",
        "summary":"Contracting part time to build a web application infrasturcture for instructors and students to easily implement computerized adaptive testing.  Technologies include: R Shiny, AWS S3, AWS EC2, Shiny Modules.",
        "range":"May 2021 - December 2021",
        "type":"Part-Time",
        "tech": "R Shiny, Auth0, Modules, AWS, EC2"
    },
    {
        "role":"R Programmer",
        "company":"[WarnerMedia](https://www.warnermedia.com/us)",
        "summary":"Contracting part time to build data pipelines and web applications for business/reporting effciency along with distilling Amazon Prime Video/Netflix data to effectively target new viewers of CNN content. Technologies include: R shiny, AWS S3, Snowflake, Comscore, Rmarkdown",
        "range":"April 2021 - November 2021",
        "type":"Part-Time",
        "tech": "R Shiny, AWS, Comscore, RMarkdown, Snowflake"
    },
    {
        "role":"R Consultant",
        "company":"[American Board of Surgeons](https://www.absurgery.org/)",
        "summary":"Contracted part time to finish a project to enable a verbal exam score submissions for board certification of surgeons. Technologies include: R shiny, AWS S3",
        "range":"April 2021 - June 2021"
    },
    {
        "role":"R Shiny Developer",
        "company":"[McAfee](https://mcafee.com/)",
        "summary":"Contracted to scale and build shiny apps for massive data distillation for model building for enhanced cross sell of products in the McAfee portfolio.",
        "range":"December 2020 - March 2021",
        "type":"Contract",
        "tech": "R Shiny, Azure, Shinyapps.io, httr, Git"
    },{
        "role":"R Shiny Developer",
        "company":"[Coca Cola Beverages Florida](https://cocacolaflorida.com/)",
        "summary":"Led and coded project to build an operation effciency tool using machine learning to better predict customer value to fairly give promotions on equipment and delivery levels.",
        "range":"August 2020 - November 2020",
        "type":"Contract",
        "tech": "R Shiny, Azure DevOps, Docker, Debian, Git"
    },
    {
        "role":"R Shiny Developer",
        "company":"[Kellogg](https://www.kelloggs.com/en_US/home.html)",
        "summary":"Developed modules to select promotional events in order to update a database for the field data cleaning.",
        "range":"September 2020",
        "type":"Contract"
    },
    {
        "role":"Data Analystics Consultant",
        "company":"[Transamerica](https://www.transamerica.com/)",
        "summary":"Built an R Shiny app integrating Qualtrics and Salesforce data for more effective reporting.",
        "range":"April 2020 - July 2020",
        "type":"Contract"
    },
    {
        "role":"R Shiny Developer",
        "company":"[Ovintiv](https://www.ovintiv.com/)",
        "summary":"Developed an app to predict oil and determine the profit after taxes via interactive maps and widgets.",
        "range":"August 2019 - April 2020",
        "type":"Contract"
    },
    {
        "role":"Data Analytics Consultant",
        "company":"[Evercommerce](https://www.evercommerce.com/)",
        "summary":"Established a data analytics function for the parent company of over 30 subsidiaries with Software as a Solution applications for various verticals in the Small/Medium Business space.",
        "range":"November 2018 - July 2019",
        "type":"Contract"
    },
    {
        "role":"Senior Market Research Analyst",
        "company":"[TSYS now Global Payments](https://www.globalpaymentsinc.com/en-ca)",
        "summary":"Led the development of a newly formed Market Research/Analytics Department within the Merchant Services Division for one of North America’s largest payment processors.",
        "range":"February 2018 - November 2018"
    },
     {
        "role":"Analyst",
        "company":"[SKIM Analytical](https://skimgroup.com/)",
        "summary":"Worked with clients to determine strategies for product development innovation, product pricing and media campaigns using consumer decision behavior analysis.  As project lead, directed work on 8 projects generating over $500,000 in revenue, writing proposals, building interactive dashboards, and presentations of findings.",
        "range":"January 2017 - February 2018"
    },
    {
        "role":"Analytics Specialist",
        "company":"[Vizeum of Dentsu Aegis](https://www.dentsu.com/us/en)",
        "summary":"Responsibilities included pulling, cleaning, analyzing, and presenting secondary data findings for Fox and Fox Sports, Discover Student Loans, Sonos, and Fox Theatrical.",
        "range":"June 2017 - February 2018"
    },
    {
        "role":"Analyst",
        "company":"[Nielsen](https://www.nielsen.com/us/en/)",
        "summary":"Worked as part of the Analytics Team onsite at Nestle’s North American Head Quarters.  Conducted multidimensional analysis across four categories, including frozen foods, beverage, ice cream, and confections.",
        "range":"December 2015 - February 2016"
    }
]
